app/Controllers/distribuidor.php

    public function agregar()
    {
        helper(['form', 'url']);
        $categoriaModel = model('CategoriaModel');
        $productoModel = model('ProductoModel');

        $data['categorias'] = $categoriaModel->findAll();
        $data['productos'] = $productoModel->findAll();
---
SELECT *
FROM `Producto`
WHERE `Producto`.`deleted_at` IS NULL