app/Controllers/inventario.php

SELECT *
FROM `Producto`
WHERE `Producto`.`deleted_at` IS NULL
---
    public function consultar()
    {
        $productoModel = model('ProductoModel');
        $data['productos'] = $productoModel->findAll();