app/Controllers/producto.php

    public function consultar(){
        $productoModel = model('ProductoModel');
        $data['productos'] = $productoModel->findAll();
---
SELECT *
FROM `Producto`
WHERE `Producto`.`deleted_at` IS NULL