app/Controllers/proveedor.php

    public function agregar(){
        helper(['form', 'url']);
        $categoriaModel = model('CategoriaModel'); // <-- Aquí la corrección
        $productoModel = model('ProductoModel');

        $data['categorias'] = $categoriaModel->findAll(); // <-- Aquí también
        $data['productos'] = $productoModel->findAll();
---
SELECT *
FROM `Producto`
WHERE `Producto`.`deleted_at` IS NULL