app/Controllers/vistas.php

SELECT *
FROM `Producto`
WHERE `Producto`.`deleted_at` IS NULL
---
    public function productos() {
        $productoModel = model('ProductoModel');
        $data['productos'] = $productoModel->findAll(); // Obtiene todos los productos

SELECT *
FROM `Producto`
WHERE `Producto`.`deleted_at` IS NULL
AND `Producto`.`id` = '1'
---
    public function comprar($id_seleccionado) {
        $productoModel = model('ProductoModel');

        // Buscar el producto por su ID
        $productoSeleccionado = $productoModel->find($id_seleccionado);

SELECT *
FROM `Compra`
WHERE `Compra`.`deleted_at` IS NULL
---
    public function compras() {
        $compraModel = model('CompraModel');

        // Obtener todas las compras realizadas
        $compras = $compraModel->findAll();